#include <Oregon_NR.h>
#include <Oregon_TM.h>
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// В данном примере описан ретранслятор пакетов 
// Может быть полезен для увеличения дальности приёма сигналов от некоторых датчиков
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Oregon_NR oregon(2, 0);   // Приёмник на D2, прерывание 0
Oregon_TM transmitter(4); // Передатчик на D4

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void setup() {
   Serial.begin(115200);
   oregon.start();        // Включаем приёмник
}

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void loop() {
  
  
  oregon.capture(0);
  if (oregon.captured)  {
          
      for (int q = 0;q < PACKET_LENGTH; q++) Serial.print(oregon.packet[q], HEX);

      //Проверяем, нужно ли этот пакет ретранслировать
      //Например, нам нужно ретранслировать пакет, если первые два нибла пакета 19h (датчик WGR800)
      if (oregon.packet[0] == 0x01 && oregon.packet[1] == 0x09)
      {
        Serial.println(" -> ");
        delay(500); 
        
        //Подготавливаем буфер передачи
        for ( int q = 0;q < 10; q++){
          transmitter.SendBuffer[q] = oregon.packet[q*2+1] + oregon.packet[q*2]*16;
        }
        //Будем передавать в том же протоколе, что и приняли
        transmitter.protocol = oregon.ver;
        
        //Передаём данные
        transmitter.SendPacket();

      }
      else Serial.println(' ');
  }
}

